[{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "hBZ4tkZJqkLZRf215I-WDg", "review_id": "00VfFQXlIy1dPYmf0DMPaA", "text": "I came to the Blumenthal Cancer Center after Dr. Higgins was highly recommended.  I have had a less than stellar experience.  He's a gynecological oncologist.  \n\nI had a biopsy done a month ago & no one from Dr. Higgins office bothered to call with the results.  I'm waiting to find out of my pre-cancerous cells have become cancerous and no one will return my calls!  Finally after 2 1/2 weeks a nurse from another Dr in the Center returned my call & read my chart and said I may need surgery.  A week or two goes by, no one from Dr Higgins returns my call about my results or impending surgery.  I finally got a call back to schedule surgery and it's a day before my surgery and I still don't have pre-op instructions.  Still waiting on more phone calls to be returned.  I have yet to talk to Dr Higgins or his nurse about my results.  \n\nAfter all the stress of just dealing with Dr Higgin's office, he's very conservative in his approach.  He scheduled a colpscopy and then when I came in for my procedure, after paying $40 co pay he says, without even examining me, that he didn't think I needed a colposcopy despite a bad pap he wouldn't check.  Now a year later I have high grade pre-cancerous cells that have been unchecked for a year.  \n\nAfter this current surgery I'm finding another gynecological oncologist.", "business_id": "81R8SNN9_RfJoMIx3lqNYg", "stars": 2, "date": "2012-01-09", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zRIG4znrwIOp8mG4ZxtVMQ", "review_id": "MqreMCmyhr0KurJ_IHhBwA", "text": "Excellent Health Care", "business_id": "81R8SNN9_RfJoMIx3lqNYg", "stars": 5, "date": "2013-12-29", "type": "review"}, {"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "0hdkW5qaQs4gTiUnRdadqA", "review_id": "dyq-MAJcRkfjtB4gatGC0Q", "text": "This is pretty nice, to have a forum to gripe about hospital food.  Carolinas Medical is a top notch hospital, I used to go here every time I broke a bone in my childhood days (and that was quite a few times).  The nurses are all very friendly, not too many witches around.  The food is no good!  I don't want to be in the hospital anyways, and when I eat I want that to be comforting.  The macaroni and cheese is dry and not really that cheesy, the bread is cold and the meat-well it probably isn't even meat.  The servers were some sweet older ladies though; they assured me that they go across the street to eat.  I don't blame them.", "business_id": "JeZRokQJYf6sV_TF7lm9_Q", "stars": 3, "date": "2008-10-05", "type": "review"}, {"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "review_id": "L-xKXvtNAO4XKO_rVIMgoQ", "text": "I have to say that CMC-Mercy is very likely my favorite hospital in the area.  It's not easy to find (which might be why I like it).  They don't have a great parking area.  Blink and you will miss it.  But the emergency room is top-notch.  They are hands-down the friendliest people I have ever met in a hospital, and they will call after you've been there just to check in and see how you are doing.  Great care.\n\nGenerally the line isn't too bad - my guess is that it's a function of the fact that you can't find the place, tucked in as they are behind Presbyterian hospital.  At first, I figured they were a back entrance to the other hospital or something.  But I'm glad that I did.", "business_id": "JeZRokQJYf6sV_TF7lm9_Q", "stars": 5, "date": "2008-12-04", "type": "review"}]