[{"votes": {"cool": 0, "useful": 4, "funny": 0}, "date": "2012-01-09", "stars": 2, "text": "I came to the Blumenthal Cancer Center after Dr. Higgins was highly recommended.  I have had a less than stellar experience.  He's a gynecological oncologist.  \n\nI had a biopsy done a month ago & no one from Dr. Higgins office bothered to call with the results.  I'm waiting to find out of my pre-cancerous cells have become cancerous and no one will return my calls!  Finally after 2 1/2 weeks a nurse from another Dr in the Center returned my call & read my chart and said I may need surgery.  A week or two goes by, no one from Dr Higgins returns my call about my results or impending surgery.  I finally got a call back to schedule surgery and it's a day before my surgery and I still don't have pre-op instructions.  Still waiting on more phone calls to be returned.  I have yet to talk to Dr Higgins or his nurse about my results.  \n\nAfter all the stress of just dealing with Dr Higgin's office, he's very conservative in his approach.  He scheduled a colpscopy and then when I came in for my procedure, after paying $40 co pay he says, without even examining me, that he didn't think I needed a colposcopy despite a bad pap he wouldn't check.  Now a year later I have high grade pre-cancerous cells that have been unchecked for a year.  \n\nAfter this current surgery I'm finding another gynecological oncologist.", "review_id": "00VfFQXlIy1dPYmf0DMPaA", "type": "review", "user_id": "hBZ4tkZJqkLZRf215I-WDg", "business_id": "81R8SNN9_RfJoMIx3lqNYg"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2013-12-29", "stars": 5, "text": "Excellent Health Care", "review_id": "MqreMCmyhr0KurJ_IHhBwA", "type": "review", "user_id": "zRIG4znrwIOp8mG4ZxtVMQ", "business_id": "81R8SNN9_RfJoMIx3lqNYg"}, {"votes": {"cool": 1, "useful": 1, "funny": 1}, "date": "2008-10-05", "stars": 3, "text": "This is pretty nice, to have a forum to gripe about hospital food.  Carolinas Medical is a top notch hospital, I used to go here every time I broke a bone in my childhood days (and that was quite a few times).  The nurses are all very friendly, not too many witches around.  The food is no good!  I don't want to be in the hospital anyways, and when I eat I want that to be comforting.  The macaroni and cheese is dry and not really that cheesy, the bread is cold and the meat-well it probably isn't even meat.  The servers were some sweet older ladies though; they assured me that they go across the street to eat.  I don't blame them.", "review_id": "dyq-MAJcRkfjtB4gatGC0Q", "type": "review", "user_id": "0hdkW5qaQs4gTiUnRdadqA", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2008-12-04", "stars": 5, "text": "I have to say that CMC-Mercy is very likely my favorite hospital in the area.  It's not easy to find (which might be why I like it).  They don't have a great parking area.  Blink and you will miss it.  But the emergency room is top-notch.  They are hands-down the friendliest people I have ever met in a hospital, and they will call after you've been there just to check in and see how you are doing.  Great care.\n\nGenerally the line isn't too bad - my guess is that it's a function of the fact that you can't find the place, tucked in as they are behind Presbyterian hospital.  At first, I figured they were a back entrance to the other hospital or something.  But I'm glad that I did.", "review_id": "L-xKXvtNAO4XKO_rVIMgoQ", "type": "review", "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 0, "useful": 6, "funny": 3}, "date": "2009-01-13", "stars": 1, "text": "I've been hospitalized here at least 3 times in ICU for 2 week stretches for severe breathing problems and pneumonia. The first time I was admitted i was stuck in a room the air was set to something like 76 degrees. For someone who is laboring to breathe, coughing continuously to circulate oxygen - this is unbearable. I broke a sweat. When I requested them to turn the thermostat down (I had my own in the room) I was told it wouldn't help because they were moving me to my permanent room shortly. \n4 hours later - I have requested the air to be turned down several times - I'm still in the same room. And I'm being repeatedly told to sit up, it'll help me breathe. Finally, I had to get mean with the nurse - and I'm NEVER mean to medical help. She finally realized that I'd now then been laboring to breathe for over 6 hours, was exhausted, in pain and had no more patience and turned the air down. I didn't get my permanent room til nearly a day and a half later. \nEvery other experience there was nearly as bad. Although I have to say that the third and final time I gave them a chance I was sent home after 2 breathing treatments and released. An hour later I was back in the hospital, this time I went to Presby, and diagnosed with walking pneumonia and hospitalized for a week. \nMercy is a joke and I only suggest going there if you have no choice - like post-mortem.", "review_id": "uaTStZXrop_pdU2fUuKfMw", "type": "review", "user_id": "sfJWzJRos2PvvM99p_PQAg", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 0, "useful": 2, "funny": 1}, "date": "2011-01-18", "stars": 3, "text": "Until recently, I had actually only been to Mercy for emergency room visits.  I am afraid to say, there have been more than a few of them.  Luckily, not all were mine.  They were however at least kept to the family - it is not like I am picking up people off the street and taking them to the emergency room, at Mercy or elsewhere.\n\nOn this visit, I had to get some lab work.  Now I was never a fan of labs.  The mad scientist lab on Movie Macabre, perhaps.  But the type of lab you would have to do in biology?  I was too busy creating (and yes, throwing) spitballs across the room.  Still not the right kind of lab, yet I hope you get the idea how I am not a fan.\n\nThe visit starts with the parking.  Mercy has never been strong here - they excel in friendliness, not in convenience.  For the emergency room, you get a nice - almost cozy - parking lot.  For the main entrance, parking is decent, but not particularly close.  Luckily, I scored a ride from some guy in a golf cart.  I am lucky that he did not seem to be a fan of Movie Macabre.  At least, if he is, he was working, and did not have time to 'cart' me to the woods.  Had he done so, I was at least close by - and how far can a golf cart really get before it dies from lack of juice?\n\nOnce inside, the main entrance has been redone.  Completely.  It is really quite impressive.  Unfortunately, they have to pay for all of that, and what should be a really simple process of sticking you becomes a rather tedious check-in (including a wristband), a journey to another floor, and waiting, waiting and waiting some more.\n\nFinally I give just two tiny vials of blood and get to leave, without so much as the courtesy of a reach around (or even a ride back to the car via the golf cart).  Then I get the bill.  Lovely.  No wonder they could afford all that remodeling.", "review_id": "e0u0Njsmac2tABmB0VkvbQ", "type": "review", "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 1, "useful": 0, "funny": 0}, "date": "2012-08-09", "stars": 4, "text": "I generally only review food but they certainly earned me stepping outside the box.\n\nI spent all day yesterday at CMC Mercy for my step fathers knee replacement.  I couldn't have been more shocked from the experience.  I parked on the far right wing and was greeted within 60 seconds of exiting my vehicle.  I was actually headed down some stairs in the parking area and a gentleman a trash can offered me assistance.  His name was Larry and was extremely kind and pointed me in the right direction.\n\nThe staff inside was equally as impressive.  They were very kind to my step father as well as my mother and I as we waited.  Prompt updates were made and the facility was extremely clean.  The DR visited late in the evening and I know he was there for a very long day.  He was very kind and wasn't in and out.  \n\nI'm just floored with the difference this was from hospitals I have been in the past.  I like to avoid the Dr. office at all cost, but if I ever need the services of Mercy, I feel comfort from this experience.", "review_id": "EFfUCZLwKS_caw2LvZp8sg", "type": "review", "user_id": "emoQY8neOSJm-xwqh4xVfQ", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2012-11-14", "stars": 4, "text": "I spent half of the day at CMC Mercy due to an anaphylatic episode. I was extremely impressed with the staff there. When I walked into the ED, the woman who check me in, Loretta, was extremely kind and continued to talk to me until I was seen just to make sure that my breathing would not get any worse. Once inside of my room, the ED nurses, Ishmel & Beth, came in and immediately began to go to work. They were tremendously polite and professional as this was my first time at CMC Mercy and my first allergic reaction. They acted great as a union and showcased above average teamwork. I was then introduced to Ashley, my nurse, and Dr. Dutton. They were both professional and polite and definitely eased my apprehensions and anxiety. I encountered a lot of different professionals there and they were all courteous and respectful. If I am ever in the need of emergency assistance, CMC Mercy will definitely be my stop!", "review_id": "eOkX1XW1FWwE0eBe9v366A", "type": "review", "user_id": "2AfcdxeD1jRelMvq3BnnrA", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 2, "useful": 2, "funny": 1}, "date": "2013-03-23", "stars": 5, "text": "My review may be a little emotional however the staff at this establishment have bowled me over. I've spent 4 of the last 10 days here with my mom as she has gone through a batteryof test. From admissions to Radiology on the 2nd floor we have been treated with the utmost respect and care. As a care partner not only did they check on my mom and her comfort level they checked to make sure I was okay. \nAfter being there for hours on end everyone still had smiling faces and caring words of encouragement . All I can say is Thanks", "review_id": "McWVGnhba_TZqs1IQ0i3XQ", "type": "review", "user_id": "zRIG4znrwIOp8mG4ZxtVMQ", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 0, "useful": 1, "funny": 1}, "date": "2015-09-25", "stars": 1, "text": "Don't be fooled by the bells and whistles and hotel-looking lobby. Care at this hospital is inconsistent and borderline negligent.  How is it the nursing staff in ICU is not as good as the staff on the regular floor??? Medication was forgotten one day because \"our hospital pharmacy does not carry it\". They could have told me that  - I had brought an entire bottle to the hospital for my husband and he would not have missed his 2 dosages that day! \nHow about checking on the patient on a regular basis when they are in ICU??? I had to inform the nurse that (1) she had forgotten to give my husband his pain medication and (2) to please take his temp bc he feels very warm (his temp was 103!!!).  Better yet is the TV monitors in the ICU rooms where you can be put in touch with a \"video nurse\" stationed in Mint Hill!!!!!! These are to be used when you need help \"and can't find a nurse\" - WTF!!!! When a loved one is in ICU you do not want to be conversing with a nurse or doctor on a video screen miles away!!!!! \nThe right hand never seemed to know what the left hand was doing in this place. Take my advice, if a loved one is staying in this hospital for anything slightly serious, sleep in the room with them!", "review_id": "Wo3uaR-NH7qoYI1IEag7OA", "type": "review", "user_id": "ElWK0zIct8SU5_fFkxMokA", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 0, "useful": 1, "funny": 0}, "date": "2015-11-10", "stars": 1, "text": "My friend was transferred to this hospital from the south park emergency room. First of all I have never experienced a more unorganized or inexperienced staff and medical center in my life. She was admitted for uncontrollable cramps and back pain with a migraine. They kept her there for 2 nights which is unheard of. She has a history of migraines and has received certain treatment for them multiple times at Presbyterian. After telling them what they give her there cmc decided to give her a whole new round of medicine that she has never had before. They took a ct scan but we never received results, still haven't. They also did not offer her any food or drink the entire 60 hours we were there!!!!! The last straw was when the unqualified and exceptionally rude nurse was trying to give her meds through her Iv. She was in severe pain and said told the nurse that something wasn't right. She told her she felt as if her vein was exploding. The nurse said nothing and just kept going. A second later blood and the liquid that was being injected into her started free flowing down her arm as in fact her vein had blown. The nurse told her to apply pressure and when the gauze she gave us was completely soaked through with blood she handed us a PAPER TOWEL!!! Also, the entire time we were there and they did any sort of work with my friend they didn't use any clean up procedures at all!!! They're were bloody gauze and packaging left on her bed table and I even had to throw away a needle that the incompetent nurse left behind. We have already filed a complaint with the North Carolina medical board and contacted a malpractice lawyer. PLEASE DO NOT GO TO THIS HOSPITAL!!!", "review_id": "wSTtSflfXj5pbdiyWQd1FQ", "type": "review", "user_id": "GgO4Q6d3mnHFwjSmpOg3Vw", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2016-07-11", "stars": 1, "text": "Just wondering how such a racist person can be employed here....says a lot for staffing. I would never go here. See photo", "review_id": "mjl6FBN0t_lSsT7tHE9YIw", "type": "review", "user_id": "RalsVlztRymFz62UgkHM4g", "business_id": "JeZRokQJYf6sV_TF7lm9_Q"}, {"votes": {"cool": 0, "useful": 0, "funny": 2}, "date": "2008-12-04", "stars": 4, "text": "This place is a hospital.  And then some.  It seems like they are always adding onto the monstrosity that is already there with another wing or deck or something.  But it's awfully nice, with a great staff and excellent response to your every question.  Unlike some other hospitals in the area (cough-Presbyterian-cough), they actually seem to care about getting you taken care of, and making sure that not only the patient but the family is attended to as well.\n\nDon't get me wrong - I'm sure that they are collecting some monumental coin in the process, but they certainly seem to be happy while doing it.", "review_id": "46Pk2qlpRtGHDBrlbGtY8Q", "type": "review", "user_id": "-_1ctLaz3jhPYc12hKXsEQ", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2011-07-17", "stars": 4, "text": "As one of the other reviewers said, this place is huge and just keeps getting bigger. I have been an overnight patient there twice, both for just one night. Both times I was admitted through the ER and, yes, the process did take a while, but it's a big city hospital, so that's what you would expect. I thought the level of attention and care was good. The people there are sympathetic and seem to care about what they are doing, and making sure that you are comfortable. There was one area where I thought they really stood out: I lost my job last year, and had trying for months to get my family into one of the local sliding scale clinics so that we could afford doctor visits and meds, only to be told that none of them were accepting new patients. The social worker at CMC took the matter into her hands, made a couple of calls, and got us in, which was a huge relief. Overall, I found that for such a big and busy hospital, the people there know and care about what they are doing.", "review_id": "tn6qD4idFbBTAOzMHU1fVg", "type": "review", "user_id": "sQMToZuHRO4NcLv_lF5pJA", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 1, "funny": 0}, "date": "2011-08-19", "stars": 5, "text": "The Levine Childrens Hospital is the best! what a wonderful place. All the nurses I dealt with were over the top. There was always someone stopping by to see if I needed something, parents get breakfast for free in the room, then 2 meal tickets per day. I had the fried chicken and mac n cheese in the 1st floor cafe is OMG the best I have ever had from a hospital! The chicken parmesan sandwich from the 3rd floor cafe- YUK, good thing I didnt pay for it. The patient rooms have a small refridgerator and are pretty big, I love that the tv has movies and games on  it or you can get movies for the DVD player in the room. \nThere is a \"drug\" train that goes by often tooting his horn as he travels the halls taking meds to nurse stations, he opens doors and calls the elevator too! The parents kitchen is pretty packed full of snacks and stuff that should satisfy any child. i love this place!", "review_id": "fLTaOzRPC1cQmKZiS6vpMg", "type": "review", "user_id": "EmpkDgejncKoP9N3HjGptw", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2012-01-05", "stars": 4, "text": "The nurses are really superb with their beside manner. Very caring and attentive.", "review_id": "YsvZG8O1TkmubuekS6Tf5g", "type": "review", "user_id": "VjoGVx5aH-cDOhcTRIvW8Q", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2012-07-06", "stars": 3, "text": "Carolinas Medical Center does a great job of making patients comfortable.  I have only been in the hospital to give birth, but I still feel a sense of vulnerability when it comes to security.  Staff members may see visitors coming and going, but I don't sense anyone is actually monitoring whether some unknown person is entering a patient's room.  That makes me a bit uneasy should I be admitted into intensive care.  This is a known issue at every hospital I have visited.  I don't know that visitor scanning is necessary but it would not hurt.  For this, I gave CMC three stars.  Note to self: send valuables home and leave them there!  Otherwise, the hospital staff are cordial when approached.  It is an accommodating facility with a cafeteria, coffee shop, gift shop, and more for patient visitors and the hospital pysician care is top rated.  Oh, parking is atrocious but is capped at $3.", "review_id": "uOtUtDcV-qHnft4L0LxC8g", "type": "review", "user_id": "J0h_oB2VEhMTlcqKmspjWQ", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 1, "useful": 1, "funny": 0}, "date": "2012-09-24", "stars": 3, "text": "Had to bring the little one here and had no waiting time to be called back.....note, this hospital actually has a 'children's er' which is pretty nice, there was no wait time to be called back but once you settled in a room everything moved at a snails pace.  They take great care of the kids other than that but with several different doctors coming in and out no one seemed to be on the same page but the nurses.", "review_id": "N3OkHre-T157tM4FRPeWwg", "type": "review", "user_id": "jp5lBxgdCpDRhSeEuRK_kA", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 1, "funny": 0}, "date": "2012-09-27", "stars": 4, "text": "No one wants to be in the hospital, but I guess it's good to have a great place to go to (when you need to).  Luckily I have not had too much experience being a patient in CMC, but I have visited a lot of people here.\n\nGet ready for a mini-city within itself and having to walk a lot.  I'm sure there is a rhyme and reason for why the hospital is planned out the way it is, but it has just grown so much there are skyways and different parking decks and crazy levels.\n\nThe nice thing about the hospital is the location.... it's located off of Morehead and Kings and there are lots of things to do if you have a loved one in the hospital in terms of walking trails (to Freedom Park) or just a stones throw away from the new Midtown shops and restaurants.", "review_id": "z8v1laAHtUOUDFORPji7GA", "type": "review", "user_id": "4G68oLRY3aHE5XUt_MUUcA", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 2, "useful": 3, "funny": 0}, "date": "2013-03-02", "stars": 5, "text": "Wow, these people are AMAZING!!\n\nI hate hospitals like no other, but WOW was i taken care of at the CMC. I came into the ER with my stomach feeling like I got stabbed, throwing up about every 5minutes with no end in sight. I was told I had to sign-in, which sucks to hear but I get it - handed over my ID and Healthcare card which they filled out the paper work and I signed. It was about 15minutes and 4 trips to the bathroom to throw up later that I was taken to get an IV started. \n\nDJ Fair was my nurse who explained what would be happening to me - AWESOME guy, kept checking up on me hours after I had been there!! Him and Kirsten got me an IV, nausa meds and some morphine - along with some heated blankets for me shivering from the chills. Went for a ct scan and a few more bags of solution and morphine I felt waaay better. Dr. Wares, Nuccio and Sprinkle took great care of me - even the gentleman that rolled me upstairs to my ct scan was very nice and kept me entertained from the pain! Once the results were in Mary explained all that was going on with my body, discussed my options and answered all my questions - she made me feel very at ease with what was happening with my body. \n\nLuckily I did not have to stay over night : )\n\nKelly M explained all of my discharge papers. She made me aware that she would be working there through the weekend so I could contact her anytime with the info that she provided. WONDERFUL lady!!\n\nThese people were GREAT!! They got me in and out quickly while keeping me completely in the loop and informed. They communicated to me clearly and continuously as to what their plan was, what was going to be happening, and the results of their findings.\n\nI would choose this ER every time!! which as we all hope, is not anytime soon!!", "review_id": "Br0slhj0ENPDfp39AyChJg", "type": "review", "user_id": "d4-0-wEjkANvDuuq9SmmKw", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 2, "useful": 4, "funny": 1}, "date": "2013-03-20", "stars": 5, "text": "Would it surprise you to know that CMC hospitals (particularly Main) is one of the top ranking hospitals in the US? It sure didnt surprise me, it is THE best, and I've been around------NO, not there! I meant hospitals, not just in the States, but abroad too. Top notch care and genuine concern for humanity is a common trait every employee at the CMC's carry. Its true, I never pass a face thats doesnt smile and wish me a great day.....I mean not many people do that these days, but they do! I guarantee a wonderful stay (hopefully you wont need it, but if so) and you will leave healthy and glowing.\n\nUntil 2010, I was a very healthy, active, energetic new graduate (Go 49'ers!) on my way to the start of a great career, until I suddenly became very, very ill. So ill that I was flown to California for a very specific treatment. Turned out to be a fairly complicated condition involving multiple vital organs I ended up staying until mid 2012. 3 surgeries and after recovering I moved back to Charlotte. Soon enough I had to be rushed to CMC-Pineville, because I was in an unconscious state, I dont remember how I got there or how many days Id been in the ICU? But the wonderful staff rushed as I gained conscious and explained everything, what they're doing, what the diagnosis, prognosis, treatent, meds, everything. 2 weeks in the ICU, the staff is high energy, quick and caring. \n\nAfter being switched to the 'step-down unit' or recovery floor, custodians cleaning every 30 minutes, fresh towels, gowns, socks and sheet change daily, they even have a person take our brk/lunck/dinner orders twice daily, with whatever else extras you want to request, lol.........thats if you have an appetite :) Again, friendly faces, caring nurses, aides, everyone is there to make you better and they do there best to make it happen. Unfortunately, I will always have such 'stay-cations' and extended stays at hospitals, but I cant mention it enough that the environment and people make a BIG difference when it comes to a quicker recovery. The smiling faces will have you smiling in no time!", "review_id": "vVtIWiAsgS3DtHRz3NW_rg", "type": "review", "user_id": "4tuG9tZ1tI7ZahbJUpwK2A", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 1, "useful": 1, "funny": 1}, "date": "2013-03-31", "stars": 4, "text": "Unfortunately I had to experience the ER today, but was very happy with the nurses, and doctors, and the rush/assessment for my visit. I was nervous and they were comforting and allowed me to leave satisfied, and with some medicine and instructions, with discharge paperwork.  Overall, great experience, but the wait time was so long.", "review_id": "U24btKQ0RQImLR2ZuM4KoA", "type": "review", "user_id": "do-fO-EruYVP_FQPMNWmZg", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 1, "funny": 0}, "date": "2014-04-16", "stars": 5, "text": "Great hospital, very clean and easy to get around.  Beautiful decorations...good food too.  Friendly staff.", "review_id": "ZsBkiiYulW6mlEpLEdN_yg", "type": "review", "user_id": "-ChVgpZlGbsJNepI0SORdw", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 1, "funny": 0}, "date": "2014-04-20", "stars": 3, "text": "As a healthcare professional, I personally experienced care rendered at CMC UNIVERSITY when a family member was admitted recently.  I have the following comments.  \n\n1- The Emergency Room was outstanding in triaging my father and coordinating his care.  EXCELLENT.  \n\n2- For the most part, nursing care was excellent.  Most of the nursing staff (RN and CNA) were exceptional but there were deficits at times.    \n\n3- Unfortuately, there are significant financial pressures on hospitals to increase the number of patients per nurse.  This requires family assistance at times in order to maximize patient care.  I found myself having to assist with transfers, insist upon diaper changes, demand that my family member be transferred from bed to chair, and demand that skin integrity be evaluated on a daily basis.  \n\n4- As with any hospital, be aware that discharge planning is initiated on DAY ONE.  Medicare determines length of stay for any given diagnosis so hospitals only make money if they meet these guidelines.  All hospitals are extremely aggressive on discharging patients quickly in order to avoid a loss of revenue and CMC is no exception.   \n\n5- Nutritional determinations are nonsensical at best.  \n\n6- There is parking lot transportation for 'handicapped' and elderly.  However, I saw a preponderance of obese people utilizing onsite transportation in order to arrive at hospital entrances.  It seems nonsensical to post marketing flyers everywhere inside the facility about 'pre-diabetes' yet endeavor to minimize exercise.  \n\n7- The facility was safe.  \n\n8- Characteristic of the US healthcare, CARE IS FRAGMENTED and not coordinated despite significant time spend by nursing on entering data into portable computers.  This phenomenon will not improve with either Obamacare or EPIC (computerized medical records).    \n\n9- PHYSICAL THERAPY WAS EXCELLENT.  \n\n10- Much time is wasted waiting for physicians, social work, physical therapy and any other referral to arrive in the patient's room.  Wait times are literally hours without any updates as to when the patient can anticipate arrivals.  There appears to be negligible planning.   \n\n11- The 'cafeteria' has reasonable quality breakfast and lunch but prices are high.  You are on your own for dinner.  \n\nBottomline:  Experience with CAROLINAS UNIVERSIY was consistent with care that you might receive in any major US hospital today.", "review_id": "oFC5H7uXBAcsiqthj4JwaQ", "type": "review", "user_id": "Ti7fazGXX6fMDRhtn7gx1Q", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2014-12-31", "stars": 1, "text": "CMC-Main's neurologists do not seem to be well informed in their field.  My spouse was found to have lesions in the myelin of his brain and, granted it is a complex issue, the neurologists, basically, tried to tell us it was all imaginary.  My husband is 29 years old, athletic, loves his job (which can be physically demanding at times), but has been confined to a wheelchair for three months.  I could accept them telling us that they were unsure of a diagnosis, or anything close to one, and referring us to someone else.  However, saying that structural damages to his brain were psycho-somatic is reckless and, in my opinion, in contradiction to their Hippocratic Oath to \"do no harm.\"  Nothing like telling a sick man to just think happy thoughts and it will all go away....\n\nThanks to the help of my sister-in-law, my husband is currently in the care of a neurologist independent of the CMC network and he was found to have multiple sclerosis.  He receives infusion treatments and is improving.  I firmly believe that had we accepted what the neurologists at CMC-Main in the stroke unit (where my husband was kept for two weeks, though stroke was almost immediately ruled out) my spouse would be confined to a bed and stuck at home.  \n\nI cannot, in good conscience, recommend CMC-Main for anything neurologically related.  Though all of our nurses were great, the hospital administration may do well in being a bit more selective in which doctors they allow to represent the CMC name.", "review_id": "m3H_JUaKBNfofPXXCem76w", "type": "review", "user_id": "onK5TrGo2ZEKpQZvfdaHaA", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 1, "funny": 1}, "date": "2015-02-28", "stars": 1, "text": "We delivered four children at this hospital and week just delivered our 5th last week and I must say it was the worst experience ever in life! We had one awesome nurse during my labor named Carrie but the rest of the nurses were not prepared, incompetent and inconsiderate. I understand that CMC is a teaching hospital but why are are many doctors allowed in your room while you are in the most pain? I let them know I would be Breastfeeding but, once my son was born, he was rushed to the nicu. I didn't get to hold my son until three days later! He had jaundice and the nurses didn't want me to pick him up. I complied because I wanted my baby better so I could hold him in my arms. Due to the fact that I wasn't allowed to hold him and they were giving him pacifiers and bottle nipples he never really learned to latch on! I was so frustrated with this hospital. I tried to give them the benefit of the doubt and went back for a tubal ligation, just to find out after being prepped for surgery that the consulting doctor failed to inform us that I need to be on birth control in order to have the surgery. Now mind you, he was a very nice guy. But I was already nervous about the procedure just to wait 3 hours to get a free freakin meal ticket and be sent home with another date for the surgery. Smh. Can we say over it?!", "review_id": "NGkYvJHFCw1r037UOmknNA", "type": "review", "user_id": "OiA1nfog20-MspN9s_mKgQ", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2015-05-04", "stars": 5, "text": "This hospital gets a five star from me. That stars goes out to the Neurological ICU team that is taking care of my uncle. Nurse Julie and Nurse Rhiannon is the best ever!!! You want these girls on your shift God forbid you should ever end up in that unit. We thank them for the amazing service. They are defiantly caregivers that care and treat you as if you are their family. Overall hospital employees were all great. \n\nNow, the cafeteria.... Best hospital cafeteria that I've ever been to. It's like a buffet. I was completely impressed. Sautéed shrimp with grits of course. Prime rib sandwich. Carrot soufflé which I've never had, to die for! Huge slices of fresh pizza and calzones. That's just the tip of the iceberg. I ate their everyday for eight days. \n\nThe gift shop is also awesome. Lots of decent and pricy items but nonetheless it was a great gift shop.", "review_id": "f9fFR5e80gcDBy0xkI7DIg", "type": "review", "user_id": "5B26MegOXxpbh-btjVYeJw", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 1, "useful": 1, "funny": 0}, "date": "2015-05-09", "stars": 4, "text": "Who really wants to go to a hospital, am I right?\n\nLet me start out with the number 1 tip. You can find parking validation in a few places. 1) information desk in the main tower slash lobby. 2) information desk over by the pharmacy and 3) sneak into the Sanger waiting area and look for the basket with a boatload of slips of paper.\n\nBelieve me, even they know no one carries cash and they have free parking available. But why they don't make this information more easily available is beyond me.\n\nThe cafeteria on level 3 is really nice with a huge amount of options. The food is better than edible.  I've found some really good things. And Ms. Easter always puts a smile on my face with her positive attitude.\n\nThe waiting room on the 5th floor for surgery is really nice but I wish they had more electrical outlets. They have a bar area with a lot of electrical outlets but, I'm embarrassed to admit, they had to point it out.  There's two Keurig's - one for coffee and one for tea. They have 2 regular coffee and 1 decaff and 1 tea (english breakfast). So bring your own if you have a favorite.  The bathrooms were very close and clean. I loved how they had a big board to track your loved one.\n\nOh, why was I there. Ok, pull out your hankies. On my brother's birthday, he called saying he thought he was having a heart attack. He was told to hang up & call 911. Which he did. He was flown into Carolinas and stabilized. He had an aortic tear. (people, if someone tells you that you have high blood pressure, please listen to them and don't blow it off)\n\nFloor 7's special ICU for cardiac patients was amazing. I had taken a red eye from SFO to CLT and somehow found the hospital (it's not too hard to get there, but i admit, I had trouble finding parking) It was easy to check into the Information desk in the tower and head up & shock my brother. He was released down to the 6th floor and the staff were great there as well. He got released but we knew he had to go back for surgery. I wish I had written down the names of the nursing staff when I was there, but I was pretty freaked out. Everyone was professional and did an excellent job.\n\nSo, that's why I'm here now. Surgery went well. Dr. Boyes had evaluated him initially and his gut was correct to wait. I'd trust him with any aortic tear I had. Two stents were put in after a bypass. My brother was very well cared for by Missy and Mona and Antonette in 11th floor ICU. He did have a complication that's well known and the team was on it like a dog on a bone. I'm like \"are you sure...\" YES. \"ok, ok\" :-)  I am a force of nature but even I know when to back down.\n\nThey've sent an occupational therapist to start working with him for when he's back home.\n\nI'm looking forward to when he's released this time, but for now, I'm confident he's getting the best care.\n\nOk, ok, the ding? Hello, the bathroom on the 11th floor was not serviced today. It ran out of paper towels around 1130. I'm sorry but please, you need to service all your restrooms even if it's on a weekend. And yeah, there are those of us who care.\n\nAnd I wish there were some quiet places where we could have private phone calls.", "review_id": "bqyD_tKNQUujpeCYnHsLRg", "type": "review", "user_id": "yz5MM8zNU6H12_hJKgr6xQ", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 1, "useful": 1, "funny": 1}, "date": "2015-05-29", "stars": 4, "text": "Fabulous hospital filled with the finest nurses, doctors and staff . Very clean and updated facilities !  Remarkable medicine remarkable hospital !", "review_id": "GJVODy8hw77cQCcjhBoUgQ", "type": "review", "user_id": "ybG5P8QlP5rA58yd7NRqDg", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2015-06-08", "stars": 1, "text": "Had a very upsetting experience today. My husband was on the 6th floor waiting to go to preop. We had a wonderful nurse Molly, and that was the one nice experience we had. They brought my husband to preop and since Molly was gone(she was our nurse the night before) and I couldn't find anybody I asked the lady at the desk. She acted mightily irritated that I had disturbed her even though she was not doing anything that I could tell. I didn't think she was going to answer but she finally said 2 words-5th floor. That was it. Why are people so rude? Would it hurt to be civil especially when they know most people they are dealing with are in emergency situations? I finally found a waiting room on the 5th floor. Waited for an hour and heard my name called. They adked me what did I think I was doing there. Staff was trying to find me on the third floor. Again no explanation of where I was supposed to go. Went to third floor and man that is a confusing floor with the cafeteria and all. Finally went over the bridge and arrived. I am sitting here now with tears behind my eyes. People at CMC- a little kindness would go a long way.", "review_id": "QV4rxWYyzIlXX6aKSEKrPg", "type": "review", "user_id": "wIBm3MD0kQazjMNqtCRztg", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 2, "funny": 0}, "date": "2015-09-20", "stars": 1, "text": "If you need emergency care and can get to Novant go there instead. This place is ghetto and a rip off. They keep charging you even after you pay. $2000 for a 20 minute visit for a slight fender bender. They should be ashamed.", "review_id": "0SK_V2dvKvCZrgqbfxpYzg", "type": "review", "user_id": "oOYanad2oObmCrXPnzFczw", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 1}, "date": "2015-09-21", "stars": 5, "text": "The best customer service I've ever seen since Chick-fil-a and they actually gave one in the building!!! Well,in the area but its a great place!!! My daughter was born here and everyone was just so happy and up beat like they really love what they do. It was like a big Family. Everyone was speaking to everyone. Was questionable about going here at 1st since its close to Uptown Charlotte, i was expecting it to be trash. I was wrong! Id drive form Matthews to here ANYTIME vs Novant of Matthew", "review_id": "-bjc_WTt7gvu_az6P6iysQ", "type": "review", "user_id": "JQ1X3_IMPbxxH2xHBe0Fpw", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 2, "funny": 1}, "date": "2015-11-09", "stars": 1, "text": "If there's another ER available go there. What an expensive mistake I made coming here. I came with elevated hypertension and chest pains. I'm still in a waiting room after 2.5 hours full of homeless just spending the night. There have been two impending violence warning announcements and several calls for security since I've been here. I asked to leave to go to the Pineville ER on my own but they tell me they'll charge me for two visits. Place is filthy!\n\nUnbelievable! They just took a woman that came in 2 hours after me.\n\nWhy oh why did I come here instead of going to Pineville like I usually do?\n\nHave now been here over 11 hours:\n- seen a real doctor once\n- haven't had the same nurse more than twice\n- have had to repeat personal info etc. again because within the same hospital the computer systems aren't compatible.\n- since coming in for ER cardiac care:\n--- 95 % of the time I have been unobserved by a medical professional\n--- at least 25% of the time the three different sets of monitoring equipment I've been attached to have failed.\n\nI just received a call from my cardiologist and find that this hospital has neither notified or consulted with his office even though I informed them of his and my relationship during admittance to the ER last night and again in this area.\n\nFinally got around to the stress test. Was told that it would be a nuclear stress test but turned out to be stress w/ultrasound. Right hand doesn't know....\n\nYou have to ask and push for things to happen and make the do what they said they would or you'll just sit there ignored while they do their things elsewhere; squeaky gets the grease.\n\nFinally did get to speak to an intelligent Doctor. I was beginning to wonder. Got great explanations and updates plus explorations I could understand about options and symptoms. Cool!\n\nNow waiting on cardiologist review of data and recommendations.", "review_id": "rdVGjVP1cgEgPjlEWiacgw", "type": "review", "user_id": "sUfgdPGxjxQ8y5qLsjlhdw", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2016-03-17", "stars": 1, "text": "This is by far THE WORST hospital emergency room that I have ever experienced. A lady sitting beside me has been in the waiting room for over 5 hours and is bleeding all over her clothes and the chair and nobody cares. One guy just reported his wallet was stolen from his bag when he left it in the examination room. My boyfriend has an appendicitis (his father is a doctor several hours from here and diagnosed him) and he has been sitting in excruciating pain in a waiting room chair for over two hours. It's filthy and packed and is a sorry excuse for a hospital. I would have driven an hour if I were dying just to avoid this place. Under no circumstances should this medical center be in business much less \"helping\" people.", "review_id": "MFkOVvs_On9ZeAkmFOoMvA", "type": "review", "user_id": "gEJemk1vhNSW8k4FgleI3w", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2016-03-26", "stars": 1, "text": "CMC Main; Worst OB floor ever!! We felt like the recovery room they put us in was a closet with an industrial roof view :( and the nurses didn't seem to know ANYTHING and were rude most of the time! They even gave my wife a medicine she was allergic to, luckily it wasn't a life threatening allergy. It was clearly marked on her chart. Please consider going elsewhere before delivering here. \n\nNow I'm not saying that all CMC hospitals are bad, just main. We actually delivered our others at CMC University and it was AMAZING!!", "review_id": "lIlbY8uimDYOf84uOcMfYQ", "type": "review", "user_id": "Y7ej-2WH6itnDI3d7X-pxQ", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2016-04-29", "stars": 1, "text": "i delivered my baby at CMC main. my one star is the result of my PHONE being STOLEN right off the nightstand in my recovery room as my husband, new baby and i slept! i am convinced that it was the nurse assigned to my room for the first shift i was there. there was only a 2.5 hour window during which we slept and we had it right before going to bed and realized it was gone almost immediately upon waking up. we had our friends and family tear the room apart multiple times just in case but it was no where to be found and since neither my husband, nor i left the room at any point before waking up that could only mean that someone came in and stole it while we slept. we filed a report with an officer and there was a security camera in the hallway, but, as expected, no one followed up. that put a damper on my entire hospital stay and still makes me so angry!\nbesides that, the entire maternity ward staff was just off. the nurses seemed disinterested and barely helpful. \nhowever, the staff in the delivery dept were amazing, including the nurses!", "review_id": "dgze_W3aFuZcdGzrJpfCBg", "type": "review", "user_id": "QXyjxOWsQam5qiXf_RE-8w", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 4, "useful": 11, "funny": 2}, "date": "2016-05-21", "stars": 5, "text": "The ER is not a place that you ever want to be, but the folks in the ER at CMC Main have done a wonderful job today taking care of a family member who had a small stroke. Dr Johnson and all others we've seen today have been fantastic. \n\nSince we were dealing with a stroke there was absolutely no wait time to have the patient treated. However, of course things do take a long time to process and we ended up being in the ER from 11 am until the patient got admitted to a room in ICU at around 6 pm. Of course there were lots of tests & procedures being done so it wasn't just time spent sitting around waiting.\n\nOnce the patient got moved up to Neuro-Surgical ICU, the excellent level of care continued. All of the doctors, nurses, and other staff members have been great.", "review_id": "iZDosjhoBmhz0O-jpWhrvw", "type": "review", "user_id": "s9I4KMcrHKki44g_eTrYqQ", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2016-07-17", "stars": 3, "text": "For the most part the care has been good, although if someone doesn't stay with the patient around the clock, consistency of care varies from one shift to the next.  I came on yelp because tonight's staff are VERY slow to respond with alarms going off.  My uncle's bed alarm went off repeatedly without anyone coming in the room.  He is a fall risk, thus the reason for the alarm and i had to push the call button twice before getting someone to come and fix it.  Now his IV is alarming saying there is a problem and it's been 15 minutes since I pressed the call button.  \n\nI do think Carolinas medical is a good hospital but no one should stay here without a family member or friend staying with them. On some shifts the staff have been great.  On others, not as good.\n\nAs for food service here...wow.  what should be easy to get right has been wrong more than half the time.  Last night they had to bring dinner 3 times before it was correct which made it very late. Tonight, it is now 6:25 pm and still no dinner.  When you are 90 and laying in a bed all day, that is too late.  I asked the staff when it should come and they said around 530 but it is never consistent. A dietician came this morning and said my uncle needed his protein supplement to help with skin break down and she would send an ice cream like substance called magic cup.  Haven't seen it yet.  Glad it won't kill him not to get it.", "review_id": "0JJjC4WUUNrSF-GOGEBTKA", "type": "review", "user_id": "7q7NOx1QgzjK2MSgCFFl6Q", "business_id": "8TwHEK6VPnZOM_zF1McnSA"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2011-08-07", "stars": 5, "text": "So thankful for the Levine family & their generous donation of this hospital. This is a state of the art facility assisting children in the area. \nClean floors, friendly staff & excellent doctors.\nI definitely will choose this hospital if I have the need (when I have a child). I recommend it to those with children.", "review_id": "FzC_GxQT9IVUgtLKnlESaA", "type": "review", "user_id": "_X0Xt2z5Q7GESxxRzvy4_g", "business_id": "BilwFx6EJoFzni0E6vRkbw"}, {"votes": {"cool": 1, "useful": 0, "funny": 0}, "date": "2011-11-30", "stars": 5, "text": "absolutely one of the best child hospitals I have been in with my special needs son. we were only here for one night but they were so eager to make sure I had everything I needed. The rooms are quite large and comfortable. There was a long desk table alond side the  window side of the room and also a couch/bed and a recliner chair. I did do some rearranging of the furniture to accomidate my son's wheelchair and the needs for me to get around. \n\nThey supplied me with sheets and blankets and pillow for the bed along with towels etc to shower. What was amazing was that they provide you with breakfast (it was a little cold) and 2 meal tickets each day. now the meal tickets are worth $5 each and it is easy to go over that so be prepared to pay the extra. but it does help defer costs.\n\nthere is also a small fridge in the room so you might want to have someone bring you some sodas or snacks to keep around. there is a kitchen available with microwave and various snacks, ice cream, soda, juice, baby food, crackers, popsicles etc. \n\nthe tv has a great variety of channels including on demand movies. there is a keyboard like a computer has for kids to choose different options on the tv like video games or movies etc. \n\nthey have a DVD player in the room to select DVD's to watch. i did not go into the childrens play area but it look huge and inviting.\n\nyou must have your ID badge on you at all times so that you can get back on the ward and so that you can gain admittance to the 3rd floor large cafeteria.\n\nthe infusion therapy section is very nice there are 4 rooms that are enormous with 2 chairs one is a extra large very comfortable recliner. a swinging flat screen tv to adjust at most comfortable angles and community bathroom. the nurses are so great! and you are given as a parent a meal ticket and they will order a food tray for the child. \n\nthey also have the cutest \"drug train\" that goes around. it is a self driving cart that looks like a train with a conductor. it carries meds to the different floors, it opens doors and calls the elevator too! so neat to follow him around", "review_id": "sb2-QrJevkNmPN_pGAtJPQ", "type": "review", "user_id": "EmpkDgejncKoP9N3HjGptw", "business_id": "BilwFx6EJoFzni0E6vRkbw"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2012-01-28", "stars": 5, "text": "We have had to bring our son to Levine at least 4 times now and every time we have been here, it's been a wonderful experience. The rooms are clean and neat, with plenty of space. Most importantly, the staff and doctors are extremely kind and attentive to the needs of my child and even us as the caregivers. This is the only place I take my child when he needs attentive care.", "review_id": "Nem1eG7IPRSJ0-_2u6z7jg", "type": "review", "user_id": "rG1m8bjCA-qLz2geh2Ypog", "business_id": "BilwFx6EJoFzni0E6vRkbw"}, {"votes": {"cool": 0, "useful": 1, "funny": 0}, "date": "2012-12-13", "stars": 5, "text": "Thank god we weren't her for our child, but I was proud knowing that this facility was here. What an advanced facility. We were visiting or daughter's friend badly hurt in an accident. The friend's father was also hurt. He was sent next door. The security is top notch. The hospital is incredibly clean and the rooms are very nice. The staff was exceptional. While I hope you don't have to visit a hospital for your young loved ones, this would be where I would want to go if it ever was needed.", "review_id": "uqmEH_1zvLGhPCAz2Pz-7A", "type": "review", "user_id": "Gjj3zyvMSc3tY2bmFRQwRg", "business_id": "BilwFx6EJoFzni0E6vRkbw"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2014-07-03", "stars": 5, "text": "Best hospital in the nation !!!!! \nGood security , every visitor requires an ID and is given a photo visitor badge. \nThe staff were really sweet ,friendly and helpful. They give you food vouchers for the cafeteria. The cafeteria has a great selection of food,Its like the food court from the mall.\nOur floor have a snack room full of goodies like cookies,cereal and juices for us. They also have playrooms from floor 8-12, lots of toys and videos to entertain the little one.", "review_id": "JTAiRySZBBLUAnZRlCIv6A", "type": "review", "user_id": "T7eyOatIKKQyW9WopkKI9w", "business_id": "BilwFx6EJoFzni0E6vRkbw"}, {"votes": {"cool": 0, "useful": 0, "funny": 0}, "date": "2014-08-19", "stars": 5, "text": "The people are wonderful. I cannot adequately express my appreciation for thew love and care given my grandson, Matthew, during his time of need. My respects to all the friendly staff members at LCH!", "review_id": "FTJIwKmMXJzAUAl-3YnOpw", "type": "review", "user_id": "csUS0hjjyjKIlRw1WxEuCw", "business_id": "BilwFx6EJoFzni0E6vRkbw"}, {"votes": {"cool": 1, "useful": 0, "funny": 1}, "date": "2015-03-02", "stars": 5, "text": "This place is incredible. We were admitted here for fiveish days ten months ago, and it will always be a place set in my heart. I'll tell ya why. \n\nThe ED is roomy and has a security guard. There is a quiet TV with kid fare. They are efficient and look you in the face when talking to you. They have these great gals who are part of a team called \"Child Life\". These gals give comfort and support to the child and the child's family. They use their abilities to engage with kids and make medical procedures less scary for them. Everyone in this ER was wonderful. We are talkin' top docs and nurses here, got it?!\n\nIf your child is admitted to the hospital proper, you will get an ID that you wear outside of your room. This ID is literally a key to your floor and certain other areas. Other places require passes that the nurses give out. Parking is validated. \n\nThe rooms are big and clean. They have two IKEAish sofas that turn into \"beds\" with the removal of cushions. There is a huge dry erase board that you can write notes on. Plenty of counterspace, sink, and the medical staff has a \"workspace\" to input data. Tons of storage, TV with DVD, thermostat, mini fridge, good lighting, and housekeeping to boot. They even put a sign outside the door letting others know certain things about the patient (e.g.\"fall risk\"). Vitals are checked often.  \n\nThe nurse hub has a secretary who can answer any question you have. They do indeed give you vouchers every day of your stay for delicious cafeteria food. Use the whole voucher- once you use it, that's it- no change. The cafeteria had decent hours- no closing at 7 pm junk, but not open till 12 am either (I am talking about the hot stuff- I think it is open at all hours with sandwiches, fruit, yogurt, chips). Very well stocked. In the mornings, near the elevators, they have free assorted coffees and muffins. It's a morning chill-spot, attached to another room with sofas and a TV. Get there early if you are picky. It goes fast.\n\nThis hospital gives you all you could possibly need. Just ask- you will be surprised at what they have. They have a laundry room with detergent. If you are waiting for a person to put their clothes in the dryer, just do it for them. It is in order to keep the system going. Otherwise, you could wait hours. Just across, there is a snack room. You can get free snack stuff- juice, milk, pudding, Jello, crackers, cereal, peanut butter. They got it all. \n\nYou can go to playrooms on certain floors at certain times. They are staffed by volunteers and have many tables. There are toddler toys, but if you have an older kid they can open up the craft closet and give you craft stuff. You can watch a movie. You can play video games. You can borrow \"Star Wars\" for the TV back in your room. You might get a teddy or a toy. I like the older volunteers as opposed to the younger ones in their twenties.  \n\nTo get fresh air, you could go to an outside area on a lower floor. We would go up to the tippy top, to the outside garden floor. We would relax in lounge chairs and watch a movie on a big screen under a porch. You could sit in the sun, too, and mess with interactive sculpture stuff. It felt secret and cozy, and had great views. You might see a helicopter take off above you. Inside, there is a bathroom. \n\nThey even have a \"radio station\" in the front lobby, and you can see what's going on in there from your TV. You can request a song, and even play bingo with the DJs; when you win, a prize is delivered to your room. There was a movie night with popcorn. A toiletries cart comes around and hooks you up if you need deodorant, toothbrushes, mags, and they even have books. Bridget the therapy dog visited us, and it really made my daughter smile. Flora with \"Child Life\" came to visit us with a giant stuffed dog. I felt like I knew her forever. \n\nTarget is nearby and so is great pizza is at Hawthorne's. The Chick fil A in the hospital is salt-free. There is a walking path by a stream in front of the hospital. The corner has a security guard. \n\nLike I said, you are getting the topmost care. Most nurses and their helpers are kind, helpful, and work hard; same with the doctors. They are compassionate and intelligent. They communicate well. They make you feel comfortable. One doc that we saw only once remembered us and took the time to say hello to us in the cafeteria. You can call them with any questions after you leave. We had an appointment snafu, and our doctor took the time to see my daughter even though he is a busy guy. \n\nBills, comments, and even body language from others have given me clues as to how darn sick my kid was. Our doc told us the situation; processing came later for me. The sudden fear was and is surreal, but this hospital kept me grounded enough to get through. Today my kid is healthily craving H&M merchandise, listening to Bowie, and drawing half-mermaid cats with six-packs. And it is because of Levine.\n\nDedicated to the 8th floor \"Cheeseburglar\", who made me smile.", "review_id": "w3XaTmdJ26728uD_3d-Diw", "type": "review", "user_id": "6FBuohzwWTQn6rBLRPElQQ", "business_id": "BilwFx6EJoFzni0E6vRkbw"}, {"votes": {"cool": 0, "useful": 1, "funny": 0}, "date": "2015-03-13", "stars": 2, "text": "Levine Children's Hospital has a fantastic reputation on a national level!  We're privileged to have such a medical facility in this area.  I need to be honest though; our stays haven't been the best.  I do realize that, sometimes, someone experiences several unfortunate experiences which cause the overall experience to be borderline miserable.  \n\nTo make a long story short, PROS - GREAT floor staff that have empathetic bedside manners and expertise too.  CONS - My child has had two major surgeries, both of which resulted in complications and infections.  In the first surgery, we never received a phone call from the surgeon or his staff...and this was considered brain surgery!  In the second surgery, the result of the complications, the \"look\" of the incision, and the lack of concern of the surgeon was just too much for us.  Another \"less-than-pleasant\" experience was found by the staff in the ER.  \n\nI honestly can't suggest anyone NOT go there!  I truly think we had back luck...multiple times!  There are too many who've had life-changing experiences.  Good for y'all; continue to support LCH.  As for us, we'll continue to go to Greenville Memorial Hospital.", "review_id": "leIIGEkX876kyy0n0aCLMQ", "type": "review", "user_id": "5ziDIgZ9-hUT0O3_e9iPnA", "business_id": "BilwFx6EJoFzni0E6vRkbw"}]